var CY0 = "┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┓";
var CY1 = "┃       - 创意 -       ┃";
var CY2 = "┃ 脚本仿制  　定制脚本 ┃";
var CY3 = "┃ 技术支持 　 游戏顾问 ┃";
var CY4 = "┃ ＷＺ添加　  地图制作 ┃";
var CY5 = "┃ 加盾防御　  售登陆器 ┃";
var CY6 = "┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┫";
var CY7 = "┃   唯一QQ:12384161    ┃";
var CY8 = "┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┛";

var 充值网站 = "https://cashier.e8pay.com/area/39f98213902cbb33d46032da04091a59";
var  数组内容 = new Array(
//奖励的和奖励数量必须一致，需要材料和材料数量必须一致，否则会出错！
//
//设置属性格式：合成装备,力量,敏捷,运气,智力,HP,MP,物攻,魔攻,物防,魔防,回避,命中,跳跃,速度



//透明装备
[
[[238000]/**/,[1902002,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品基础坐骑"]/**/],
[[238000]/**/,[1912000,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品基础坐骑"]/**/]

],

//奇珍异宝
[

[[1100]/**/,[4032226,1],["黄金猪猪"]/**/]
],


//勋章类
[
[[58]/**/,[1142893,10,10,10,10,10,5,5,10,1,1,1,1,1,1],["飞龙在天派门徒	"]/**/],
[[58]/**/,[1142894,10,10,10,10,10,5,5,10,1,1,1,1,1,1],["虎啸九天派门徒	"]/**/]

],


//时装类
[
[[200000]/**/,[1042285,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["拼色点点T恤	"]/**/],
[[200000]/**/,[1042132,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["爱情海蓝T恤	"]/**/],
[[200000]/**/,[1042222,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["柠檬色可爱T恤	"]/**/],
[[200000]/**/,[1042361,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["中式祥云T恤"]/**/],
[[200000]/**/,[1042163,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["我最IN－T恤"]/**/],
[[200000]/**/,[1060188,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["白色夏日短裤	"]/**/],
[[200000]/**/,[1061212,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["白色夏日短裙	"]/**/],
[[200000]/**/,[1062156,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["紫色马赛克短裤"]/**/],
[[200000]/**/,[1062204,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["彩糖短裤		"]/**/],
[[200000]/**/,[1062235,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["中式祥云短裤"]/**/],
[[200000]/**/,[1062236,10,10,10,10,100,100,10,10,100,100,30,30,5,5],["中式祥云短裙	"]/**/]
],


//时尚武器
[

[[238000]/**/,[1912406,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902406,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912404,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902404,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912403,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902403,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912412,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902412,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912413,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902413,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912416,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902416,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912417,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902417,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912420,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902420,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1902409,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/],
[[238000]/**/,[1912409,20,20,20,20,0,0,1,1,1,1,1,1,1,1],["全职业新品时装坐骑"]/**/]

],


[
[[28]/**/,[1032241,2,2,2,2,0,0,1,1,0,0,0,0,0,0],["魅惑耳环-非点装"]/**/],
[[500000]/**/,[1022246,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["卡米拉眼镜-非点装"]/**/],
[[500000]/**/,[1012319,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["8周年点点红-非点装"]/**/],
[[500000]/**/,[1132258,15,15,15,15,300,300,15,15,100,100,50,50,10,10],["完美点绝对腰带-非点装"]/**/]

],


//超级戒指
[
[[18]/**/,[1112135,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩名片戒指"]/**/],
[[18]/**/,[1112238,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩聊天戒指"]/**/],
[[18]/**/,[1112181,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩名片戒指"]/**/],
[[18]/**/,[1112294,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩聊天戒指"]/**/],
[[18]/**/,[1112178,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩名片戒指"]/**/],
[[18]/**/,[1112290,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩聊天戒指"]/**/],
[[18]/**/,[1112276,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩名片戒指"]/**/],
[[18]/**/,[1112164,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩聊天戒指"]/**/],
[[18]/**/,[1112271,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩名片戒指"]/**/],
[[18]/**/,[1112159,2,2,2,2,0,0,1,1,1,1,1,1,1,1],["云朵羊咩咩聊天戒指"]/**/]

],


//超级坐骑
[
[[500000]/**/,[1902032,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇"]/**/],
[[500000]/**/,[1912025,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902052,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912045,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902055,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912048,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902336,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912336,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902339,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912339,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902342,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912342,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902351,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912351,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902401,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912401,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1902402,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],
[[500000]/**/,[1912402,10,10,10,10,1000,1000,10,10,50,50,20,20,10,10],["梦魇皮鞍"]/**/],

]










);
var dxsz = new Array("一","二","三","四","五","六","七","八","九","十","十一","十二","十三");

var 兔子1 = "#fEffect/CharacterEff/1082565/0/0#";
var 兔子2 = "#fEffect/CharacterEff/1082565/2/0#";
var 兔子3 = "#fEffect/CharacterEff/1082565/4/0#";
var 表情高兴 = "#fUI/GuildBBS/GuildBBS/Emoticon/Basic/2#";
var 小金币 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var 点券图标 = "#fUI/CashShop/CashItem/0#";
var sels;
var status = -1;
var lbtb = "#v5680388#";
var 白金礼包 = "#fItem/Special/0910.img/9101038/icon#";
var M14 = "#fEffect/CharacterEff/1112925/0/0#";
// true 开启
// false 关闭
function start() {
	
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else if (mode == 0) {
        //status--;
		cm.dispose();
		return;
    } else {
        cm.dispose();
        return;
    }
    if (status == 0) {
		var msg = "";	
        msg += "\t\t\t    #e#b"+表情高兴+"    驯 兽 师    "+表情高兴+"#k#n\r\n\r\n";
		
        //msg += "#L1000#"+点券图标+"#d点卷余额："+cm.getPlayer().getCSPoints(1)+"  [#b点击充值点卷#d]#l\r\n\r\n"             		
		
        msg += "#L0#"+M14+"热卖基础坐骑#l                 #L4#"+M14+"超级时装坐骑#l\r\n"
        cm.sendSimple("" + msg + "");
		
	} else if (status == 1) {	
        if (selection == 1000) {
			cm.openWeb(充值网站); //打开网页
			cm.playerMessage(5, "正在打开充值网站！如果没有弹出充值网站请联系GM1"); //个人看见的对话 5红色字 6蓝色字 1为弹窗
			cm.dispose();
			return;			
		}
		
		flx = selection;
		
		
		var msg = "";	
        msg += "\t\t\t      #e#b"+表情高兴+"  坐骑中心  "+表情高兴+"#k#n\r\n\r\n";
		
        //msg += "#L1000#"+点券图标+"#d元宝余额："+cm.getmoneyb()+"  [#b点击充值点卷#d]#l\r\n\r\n"    //网站充值  
        msg += "   "+点券图标+"#d点卷余额："+cm.getPlayer().getCSPoints(1)+"  #l\r\n\r\n"		
		
		
		for (var i = 0; i <  数组内容[flx].length; i++) {			         
			msg +="#L         "+i+"##d#v"+数组内容[flx][i][1][0]+"##b[查看详情]#l          \n"
            //msg += "   "+点券图标+"#d售价："+数组内容[flx][i][0][0]+" 元宝        #l\r\n"					
        }

		
        cm.sendSimple("" + msg + "");
    } else if (status == 2) {
		if (selection == 1000) {
			cm.openWeb(充值网站); //打开网页
			cm.playerMessage(5, "正在打开充值网站！如果没有弹出充值网站请联系GM1"); //个人看见的对话 5红色字 6蓝色字 1为弹窗
			cm.dispose();
			return;
			
		}
		
		
		检测材料 = false;
		组位 = selection;
		

        sels = selection;
        var msg = "";		
            item = cm.getEquip(数组内容[flx][组位][1][0]).copy();//从WZ获取装备属性
			
			if (数组内容[flx][组位][1][5] == null ) {
			wplx = true;
			msg += "#e#b#i"+ 数组内容[flx][组位][1][0]+":##z"+ 数组内容[flx][组位][1][0]+"#   #r是否购买？#n\r\n"
				
			
			msg += ""+数组内容[flx][组位][2][0]+"\r\n"
			msg += "  #b数量："+数组内容[flx][组位][1][1]+"\r\n"			
			} else {
			wplx = false;	
			
			msg += "#e#b#v"+ 数组内容[flx][组位][1][0]+"##t"+ 数组内容[flx][组位][1][0]+"#   #r是否购买？#n\r\n"
			
			msg += "#b物品属性详情\r\n"
			
			
			if (数组内容[flx][组位][1][1] > 0 || item.getStr() ) {
			if (数组内容[flx][组位][1][1] > 0  ) {
			item.setStr(数组内容[flx][组位][1][1]);	
			}
			msg += "#d力量:"+ item.getStr() +" "			
			}
			
			
						
			if (数组内容[flx][组位][1][2] > 0 || item.getDex() ) {
			if (数组内容[flx][组位][1][2] > 0  ) {
			item.setDex(数组内容[flx][组位][1][2]);
			}
			msg += "#d敏捷:"+ item.getDex() +" "			
			}
			
			if (数组内容[flx][组位][1][3] > 0 || item.getInt() ) {
			if (数组内容[flx][组位][1][3] > 0){
			item.setInt(数组内容[flx][组位][1][3]);
			}
			msg += "#d智力:"+ item.getInt() +" "			
			}
			
			if (数组内容[flx][组位][1][4] > 0 || item.getLuk() ) {
			if (数组内容[flx][组位][1][4] > 0) {
			item.setLuk(数组内容[flx][组位][1][3]);
			}
			msg += "#d运气:"+ item.getLuk() +"\r\n"			
			}
			
			if (数组内容[flx][组位][1][5] > 0 || item.getHp() ) {
			if (数组内容[flx][组位][1][5] > 0){
			item.setHp(数组内容[flx][组位][1][5]);
			}
			msg += "#dHP:"+ item.getHp() +" "
			
			}
			if (数组内容[flx][组位][1][6] > 0 || item.getMp() ) {
			if (数组内容[flx][组位][1][6] > 0){
			item.setMp(数组内容[flx][组位][1][6]);
			}
			msg += "#dMP:"+ item.getMp() +" "
			
			}
			if (数组内容[flx][组位][1][7] > 0 || item.getWatk() ) {
			if (数组内容[flx][组位][1][7] > 0){
			item.setWatk(数组内容[flx][组位][1][7]);
			}
			msg += "#d物攻:"+ item.getWatk() +" "
			
			}
			
			
			if (数组内容[flx][组位][1][8] > 0 || item.getMatk() ) {
			if (数组内容[flx][组位][1][8] > 0){
			item.setMatk(数组内容[flx][组位][1][8]);
			}
			msg += "#d魔攻:"+ item.getMatk() +"\r\n"
			
			}
			
			if (数组内容[flx][组位][1][9] > 0 || item.getWdef() ) {			
			if (数组内容[flx][组位][1][9] > 0){
			item.setWdef(数组内容[flx][组位][1][9]);
			}
			msg += "#d物防:"+ item.getWdef() +" "
			}
			
			
			
			if (数组内容[flx][组位][1][10] > 0 || item.getMdef() ) {
			if (数组内容[flx][组位][1][10] > 0){
			item.setMdef(数组内容[flx][组位][1][10]);
			}
			msg += "#d魔防:"+ item.getMdef() +" "
			
			}
			if (数组内容[flx][组位][1][11] > 0 || item.getAvoid() ) {
			if (数组内容[flx][组位][1][11] > 0){
			item.setAvoid(数组内容[flx][组位][1][11]);
			}
			msg += "#d回避:"+ item.getAvoid() +" "
			
			}
			
			if (数组内容[flx][组位][1][12] > 0 || item.getAcc() ) {
			if (数组内容[flx][组位][1][12] > 0){
			item.setAcc(数组内容[flx][组位][1][12]);
			}
			msg += "#d命中:"+ item.getAcc() +" \r\n"
			
			}
			
			if (数组内容[flx][组位][1][13] > 0 || item.getJump() ) {
			if (数组内容[flx][组位][1][13] > 0){
			item.setJump(数组内容[flx][组位][1][13]);
			}
			msg += "#d跳跃:"+ item.getJump() +" "
			
			}
			if (数组内容[flx][组位][1][14] > 0 || item.getSpeed() ) {
			if (数组内容[flx][组位][1][14] > 0){
			item.setSpeed(数组内容[flx][组位][1][14]);
			}
			msg += "#d速度:"+ item.getSpeed() +" \r\n"
			
			}						
													
			
			msg += "\r\n#b说明："+数组内容[flx][组位][2][0]+"\r\n"
			}
										           				
			msg += ""+点券图标+"#b售价："+数组内容[flx][组位][0][0]+"点卷\r\n"
				
        cm.sendYesNo(msg);
    } else if (status == 3) {
		
		if (cm.getPlayer().getCSPoints(1) < 数组内容[flx][组位][0][0]) {
		cm.sendOk("点卷不足无法购买！");	
        cm.dispose();
		} else if (!cm.canHold(数组内容[flx][组位][1][0],1)) {     
		cm.sendOk("背包空间不足哦！或者已经有一件了...");	
        cm.dispose();
		} else if (!cm.canHold()) {     
		cm.sendOk("所有背包空间必须留出一个空间");	
        cm.dispose();
		} else {	
		cm.gainNX(-数组内容[flx][组位][0][0]);
		if (wplx) {
		cm.gainItem(数组内容[flx][组位][1][0],数组内容[flx][组位][1][1]);
		cm.sendOk("成功购买：#v"+数组内容[flx][组位][1][0]+"##t"+数组内容[flx][组位][1][0]+"# X "+数组内容[flx][组位][1][1]+"");
		
		取服务器时间 = Packages.tools.FileoutputUtil.CurrentReadable_Time();
		Packages.tools.FileoutputUtil.packetLog("log\\玩家相关\\藏宝阁记录.log",取服务器时间+" [驯兽师NPC] "+cm.getName()+" 获得[ID:"+数组内容[flx][组位][1][0]+"  物品:"+cm.getItemName(数组内容[flx][组位][1][0])+"  数量："+数组内容[flx][组位][1][1]+"]\r\n");
		
		} else {		
		cm.sendOk("成功购买：#v"+数组内容[flx][组位][1][0]+"##t"+数组内容[flx][组位][1][0]+"#");
		取服务器时间 = Packages.tools.FileoutputUtil.CurrentReadable_Time();	
		item.setGMLog("驯兽师NPC获取|购买者："+cm.getPlayer().getName()+"|"+取服务器时间);
		item.setFlag(1);
		cm.addFromDrop(item);	
		cm.worldMessage("【驯兽师NPC】[" + cm.getPlayer().getName() + "]","某人通过驯兽师NPC购买了一件不错的装备...");
		取服务器时间 = Packages.tools.FileoutputUtil.CurrentReadable_Time();		
		Packages.tools.FileoutputUtil.packetLog("log\\玩家相关\\驯兽师NPC记录.log",取服务器时间+" [驯兽师NPC] "+cm.getName()+" 获得[ID:"+数组内容[flx][组位][1][0]+"  物品:"+cm.getItemName(数组内容[flx][组位][1][0])+"]\r\n");
		}
		
		
        cm.dispose();
        return;
        }		
        cm.dispose();
        return;
    } else {
        cm.sendNext("#r发生错误: mode : " + mode + " status : " + status);
        cm.dispose();
    }
}