var CY0 = "┣━━━━━━━━━━━━━━ ━━━━━━━━━━━━━━━━┫";
var CY1 = "┣       - 创意 -       ┫";
var CY2 = "┣ 玩法仿制  　定制脚本 ┫";
var CY3 = "┣ 技术支持 　 游戏顾问 ┫";
var CY4 = "┣ ＷＺ添加　  地图制作 ┫";
var CY5 = "┣ 加盾防御　  售登陆器 ┫";
var CY7 = "┣ 手游开服    端游开服 ┫";
var CY8 = "┣━━━━━━━━━━━━━━ ━━━━━━━━━━━━━━━━┫";
var CY9 = "┣    唯一微信:ZerekY   ┫";
var CY0 = "┣━━━━━━━━━━━━━━ ━━━━━━━━━━━━━━━━┫";

var ca = java.util.Calendar.getInstance();
var year = ca.get(java.util.Calendar.YEAR); //获得年份
var month = ca.get(java.util.Calendar.MONTH) + 1; //获得月份
var day = ca.get(java.util.Calendar.DATE);//获取日
var hour = ca.get(java.util.Calendar.HOUR_OF_DAY); //获得小时
var minute = ca.get(java.util.Calendar.MINUTE);//获得分钟
var second = ca.get(java.util.Calendar.SECOND); //获得秒
var weekday = ca.get(java.util.Calendar.DAY_OF_WEEK);// 1是星期天 7是星期6

var index; //用来标志选择哪个百宝卷套餐

status = -1;
var itemList = [
//id   概率  数量   
//如果是装备  数量要设置为1 不然会报错
    [1012171, 1, 1, 2],//鬼娃
    [1003843, 1, 1, 2],//狐狸面具
    [1032234, 1, 1, 2],//蓝心耳环
    [1112951, 3, 1, 2], //麦格
	[2070006, 3, 1, 2], //齿轮镖
    [2070007, 2, 1, 2], //月牙标
	[2022680, 70, 1, 1], //藏宝图
	[1032220, 8, 1, 1], //低级贝勒德耳环
    [1032221, 3, 1, 1], //中级贝勒德耳环
    [1032222, 2, 1, 2], //高级贝勒德耳环
    [1122264, 8, 1, 1], //低级贝勒德刻印吊坠
    [1122265, 3, 1, 1], //中级贝勒德刻印吊坠
    [1122266, 2, 1, 2], //高级贝勒德刻印吊坠
    [4000463, 100, 1, 1], // 国庆纪念币
	[1092030, 2, 1, 1], //枫叶盾
    [1402037, 3, 1], //龙背刃
    [1142790, 3, 1,1], //第104期训练生勋章
    [1142788, 0, 1,1], //进击的巨人勋章
    [1002850, 0, 1], //圣诞鹿变身帽
    [1050100, 10, 1],//蓝浴巾
    [1050100, 10, 1], //蓝浴巾	    
    [1050127, 10, 1], //浴巾	    
    [1051098, 10, 1], //红浴巾	    
    [1051140, 10, 1], //黄色沐浴巾	
    [1051172, 10, 1], //黄色沐浴巾	
    [1082161, 5, 1, 1], //星纹手套
    [1082162, 5, 1, 1], //爱心手套
    [1082169, 5, 1, 1], //月兔手套
    [1082170, 5, 1, 1], //粉色电子表
    [1082171, 5, 1, 1], //蓝色电子表
    [1082172, 5, 1, 1], //点点手套
    [1082173, 5, 1, 1], //绝缘手套
    [1112730, 12, 1], //龙魂敏
    [1112731, 12, 1], //龙魂智
    [1112733, 12, 1], //龙魂力
    [1112734, 12, 1], //龙魂全
    [1032138, 10, 1,1], //龙魂耳环
    [1032206, 10, 1,1], //神话耳环复原第1阶段
    [1012319, 20, 1,1], //8周年点点红
    [1022232, 6, 1], //布莱克缤瞳印
    [1012307, 21, 1], //冰晶脸饰
    [1012300, 25, 1,1], //圣诞鹿的鼻子
    [1012416, 20, 1,1], //草莓雪糕
    [1012071, 30, 1], //巧克力雪糕
    [1012132, 45, 1,1], //鸟嘴面饰
    [1122253, 2, 1,1], //10周年白色吊坠
    [1122252, 2, 1,1], //10周年黑色吊坠
    [1122058, 20, 1,1], //休彼德蔓的混沌项链
    [1122019, 45, 1], //初代冒险之心
    [1113074, 4, 1,1], //贝勒高
    [1113073, 8, 1,1], //贝勒中
    [1113072, 10, 1,1], //贝勒抵
    [1073057, 10, 1,1], //冒险岛寻宝鞋子
    [1132228, 6, 1,1], //10周年黑色腰带
    [1132229, 6, 1,1], //10周年白色腰带
    [1132287, 5, 1,1], //冒险岛寻宝腰带
    [1132135, 10, 1,1], //希望之树之传说腰带
    [1132134, 10, 1,1], //希望之树之金色腰带
    [1132133, 10, 1,1], //希望之树之银色腰带
    [1132244, 10, 1,1], //中级贝勒德刻印腰带
    [1132243, 15, 1,1], //低级贝勒德刻印腰带
    [1012471, 7, 1,1], //11周年神圣口香糖
    [1012377, 10, 1,1], //10周年白色口香糖
    [1012376, 10, 1,1], //10周年黑色口香糖
    //[1092049, 20, 1,1], //热情剑盾
    //[1092050, 50, 1,1], //冷艳剑
        [1113283, 5, 1,1], //斗士戒指
    //[1114243, 1, 1,1], //玛瑙”
    [1112596, 15, 1], //三国名将挑战者戒指
    [1112727, 10, 1], //传说戒指
    [1112747, 30, 1], //夜光法师戒指
    [1112766, 10, 1], //C级力量宝石戒指
    [1112765, 10, 1], //B级力量宝石戒指
    [1112764, 4, 1,1], //A级力量
    [1112763, 3, 1,1], //S级力量
    [1112770, 10, 1], //C级运气宝石戒指
    [1112769, 8, 1], //B级运气宝石戒指
    [1112767, 3, 1,1], //S级运气
    [1112768, 5, 1,1], //A级运气
    [1112774, 15, 1], //C级橙子宝石戒指
    [1112773, 10, 1], //B级橙子宝石戒指
    [1112772, 10, 1,1], //A级智慧
    [1022117, 12, 1,1], //玛瑙龙眼镜
    [1022129, 30, 1,1], //精灵眼镜
    [1022172, 35, 1], //情人节甜蜜眼镜
    [1022165, 35, 1], //瑞贝卡的经典眼镜
    [1022163, 35, 1], //快速成长眼镜
    [1022252, 35, 1], //琳的碎裂眼镜
    [1102562, 3, 1], //10周年黑色披风
    [1102563, 4, 1], //10周年白色披风
    [1102828, 5, 1], //冒险岛寻宝披风
    [1102322, 10, 1], //传说冒险岛披风
    [1102163, 10, 1], //贵族披风
    [1102084, 50, 1], //粉红盖亚披风
    [1102085, 50, 1], //黄色盖亚披风
    [1102086, 50, 1], //紫色盖亚披风
    [1102021, 50, 1], //蓝斗士披风
    [1102022, 50, 1], //红斗士披风
    [1102023, 50, 1], //白斗士披风
    [1102024, 50, 1], //黑斗士披风
    [1102000, 50, 1], //绿色冒险披风
    [1102001, 50, 1], //蓝色冒险披风
    [1102002, 50, 1], //红色冒险披风
    [1102003, 50, 1], //白色冒险披风
    [1102004, 50, 1], //黑色冒险披风
    [1102468, 50, 1], //冒险岛披风
    [1102469, 50, 1], //冒险岛披风
    [1102470, 50, 1], //冒险岛披风
    //衣服
    //=======================================
    [1050067,20,1,1], //蓝天上之衣(男) 魔法师68
    [1050068,20,1,1], //红天上之衣(男) 魔法师68
    [1050069,20,1,1], //褐天上之衣(男) 魔法师68
    [1050070,20,1,1], //黑天上之衣(男) 魔法师68
    [1051052,20,1,1], //蓝天上之衣(女) 魔法师68
    [1051053,20,1,1], //红天上之衣(女) 魔法师68
    [1051054,20,1,1], //褐天上之衣(女) 魔法师68
    [1051055,20,1,1], //黑天上之衣(女) 魔法师68
    [1050072,15,1,1], //绿神仙之服(男) 78
    [1050073,15,1,1], //蓝神仙之服(男) 78
    [1050074,15,1,1], //黑神仙之服(男) 78
    [1051056,15,1,1], //绿神仙之服(女) 78
    [1051057,15,1,1], //蓝神仙之服(女) 78
    [1051058,15,1,1], //黑神仙之服(女) 78
    [1050075,15,1,1], //红宫衣(男) 弓手80
    [1050076,15,1,1], //蓝宫衣(男) 弓手80
    [1050077,15,1,1], //绿宫衣(男) 弓手80
    [1050078,15,1,1], //黑宫衣(男) 弓手80
    [1051066,15,1,1], //红宫衣(女) 弓手80
    [1051067,15,1,1], //蓝宫衣(女) 弓手80
    [1051068,15,1,1], //绿宫衣(女) 弓手80
    [1051069,15,1,1], //黑宫衣(女) 弓手80
    [1050077,15,1,1], //绿白银铠甲(女) 战士80
    [1050078,15,1,1], //红白银铠甲(女) 战士80
    [1050079,15,1,1], //蓝白银铠甲(女) 战士80
    [1050080,15,1,1], //黑白银铠甲(女) 战士80
    [1050080,15,1,1], //绿白银铠甲(男) 战士80
    [1050081,15,1,1], //红白银铠甲(男) 战士80
    [1050082,15,1,1], //蓝白银铠甲(男) 战士80
    [1050083,15,1,1], //黑白银铠甲(男) 战士80
    [1050096,10,1,1], //绿侠盗服(男) 飞侠100
    [1050097,10,1,1], //蓝侠盗服(男) 飞侠100
    [1050098,10,1,1], //红侠盗服(男) 飞侠100
    [1050099,10,1,1], //黑侠盗服(男) 飞侠100
    [1051090,10,1,1], //绿侠盗服(女) 飞侠100
    [1051091,10,1,1], //蓝侠盗服(女) 飞侠100
    [1051092,10,1,1], //红侠盗服(女) 飞侠100
    [1051093,10,1,1], //黑侠盗服(女) 飞侠100
    [1052125,15,1,1], //高军服(男) 海盗80
    [1040108,15,1,1],  //绿隐者之服    飞侠80
    [1040109,15,1,1],  //红隐者之服    飞侠80
    [1040110,15,1,1],  //黑隐者之服    飞侠80
    [1041105,15,1,1],  //绿隐者之服    飞侠80
    [1041106,15,1,1],  //红隐者之服    飞侠80
    [1041107,15,1,1],  //黑隐者之服    飞侠80
        [1082097, 30, 1, 1], //黄金名誉手套
    [1082098, 30, 1, 1], //褐战魂手套
    [1082099, 30, 1, 1], //蓝战魂手套
    [1082100, 30, 1, 1], //黑战魂手套
    [1082103, 30, 1, 1], //青铜暗影手套
    [1082104, 30, 1, 1], //锂矿暗影手套
    [1082105, 30, 1, 1], //黑暗影手套
    [1082106, 30, 1, 1], //蓝神眼手套
    [1082107, 30, 1, 1], //黄金神眼手套
    [1082108, 30, 1, 1], //黑神眼手套
    [1082109, 20, 1, 1], //红天使手套
    [1082110, 20, 1, 1], //蓝天使手套
    [1082111, 20, 1, 1], //绿天使手套
    [1082112, 20, 1, 1], //黑天使手套
    [1082114, 20, 1, 1], //马尔斯蓝拳套
    [1082115, 20, 1, 1], //马尔斯绿拳套
    [1082116, 20, 1, 1], //马尔斯红拳套
    [1082117, 20, 1, 1], //马尔斯黑拳套
    [1082118, 20, 1, 1], //德古拉蓝手套
    [1082119, 20, 1, 1], //德古拉紫手套
    [1082120, 20, 1, 1], //德古拉红手套
    [1082121, 20, 1, 1], //魔力绿手套
    [1082122, 20, 1, 1], //魔力蓝手套
    [1082123, 20, 1, 1], //魔力黑手套
    [1082124, 20, 1, 1], //基督山手套
    [1082125, 10, 1, 1], //弦影手套(红)
    [1082126, 10, 1, 1], //弦影手套(绿)
    [1082127, 10, 1, 1], //弦影手套(黑)
    [1082128, 10, 1, 1], //裂天手套(绿)
    [1082129, 10, 1, 1], //裂天手套(紫)
    [1082130, 10, 1, 1], //裂天手套(黑)
    [1082131, 10, 1, 1], //杰斯特手套(蓝)
    [1082132, 10, 1, 1], //杰斯特手套(绿)
    [1082133, 10, 1, 1], //杰斯特手套(红)
    [1082134, 10, 1, 1], //杰斯特手套(黑)

    
    [1072660, 30, 1, 1], //紫金枫叶鞋
    [1072666, 30, 1, 1], //专属紫金枫叶鞋


    //盾牌
    [1090000, 5, 1, 1], //爱心盾牌
    [1091000, 5, 1, 1], //爱心盾牌
    [1092000, 45, 1, 1], //钢盾
    [1092001, 45, 1, 1], //三角赤盾
    [1092002, 45, 1, 1], //红十字盾牌
    [1092003, 45, 1, 1], //木盾
    [1092004, 45, 1, 1], //骷髅盾
    [1092005, 45, 1, 1], //木制圆盾
    [1092006, 45, 1, 1], //锂矿圆盾
    [1092007, 45, 1, 1], //战斗盾牌
    [1092008, 45, 1, 1], //锅盖
    [1092031, 5, 1, 1], //瓢虫
    [1092032, 5, 1, 1], //饼干
    [1092033, 5, 1, 1], //幸运草
    [1092034, 5, 1, 1], //邪神蚩尤战盾
    [1092035, 5, 1, 1], //可乐战盾
    [1092036, 5, 1, 1], //绿色臂盾
    [1092037, 5, 1, 1], //紫色臂盾
    [1092038, 5, 1, 1], //蓝色臂盾
    [1092039, 5, 1, 1], //枯叶盾
    [1092040, 5, 1, 1], //雪花盾牌
    [1092041, 5, 1, 1], //习得技能盾牌
    [1092042, 5, 1, 1], //铁甲盾牌
    [1092044, 5, 1, 1], //心型迷你盾牌
    [1092049, 10, 1, 1], //热情剑盾
    [1092050, 10, 1, 1], //冷艳剑盾
    [1092051, 10, 1, 1], //啤酒杯盾牌
    [1092053, 10, 1, 1], //无敌石板盾牌
    [1092070, 50, 1], // 一代不速之客战士盾
    [1092071, 40, 1], // 二代不速之客战士盾
    [1092072, 30, 1], // 三代不速之客战士盾
    [1092073, 5, 1], // 末代不速之客战士盾
    //[1092074, 40, 1], // 至尊不速之客战士盾
    [1092075, 50, 1], // 一代不速之客法师盾
    [1092076, 40, 1], // 二代不速之客法师盾
    [1092077, 30, 1], // 三代不速之客法师盾
    [1092078, 5, 1], // 末代不速之客法师盾
    //[1092079, 40, 1], // 至尊不速之客法师盾
    [1092080, 50, 1], // 一代不速之客飞侠盾
    [1092081, 40, 1], // 二代不速之客飞侠盾
    [1092082, 30, 1], // 三代不速之客飞侠盾
    [1092083, 5, 1], // 末代不速之客飞侠盾
    //[1092084, 40, 1], // 至尊不速之客飞侠盾

    [1302143, 50, 1], // 一代不速之客单手剑
    [1312058, 50, 1], // 一代不速之客单手斧
    [1322086, 50, 1], // 一代不速之客单手钝器
    [1332116, 50, 1], // 一代不速之客短剑-运
    [1332121, 50, 1], // 一代不速之客短剑-力
    [1342029, 50, 1], // 一代不速之客刀
    [1372074, 50, 1], // 一代不速之客短杖
    [1382095, 50, 1], // 一代不速之客长杖
    [1402086, 50, 1], // 一代不速之客双手剑
    [1412058, 50, 1], // 一代不速之客双手斧
    [1422059, 50, 1], // 一代不速之客双手钝器
    [1432077, 50, 1], // 一代不速之客枪
    [1442107, 50, 1], // 一代不速之客矛
    [1452102, 50, 1], // 一代不速之客弓
    [1462087, 50, 1], // 一代不速之客弩
    [1472113, 50, 1], // 一代不速之客 拳套
    [1482075, 50, 1], // 一代不速之客 指节
    [1492075, 50, 1], // 一代不速之客短枪
    [1302144, 30, 1], // 二代不速之客单手剑
    [1312059, 30, 1], // 二代不速之客单手斧
    [1322087, 30, 1], // 二代不速之客单手钝器
    [1332117, 30, 1], // 二代不速之客短剑-运
    [1332122, 30, 1], // 二代不速之客短剑-力
    [1342030, 30, 1], // 二代不速之客刀
    [1372075, 30, 1], // 二代不速之客短杖
    [1382096, 30, 1], // 二代不速之客长杖
    [1402087, 30, 1], // 二代不速之客双手剑
    [1412059, 30, 1], // 二代不速之客双手斧
    [1422060, 30, 1], // 二代不速之客双手钝器
    [1432078, 30, 1], // 二代不速之客枪
    [1442108, 30, 1], // 二代不速之客矛
    [1452103, 30, 1], // 二代不速之客弓
    [1462088, 30, 1], // 二代不速之客弩
    [1472114, 30, 1], // 二代不速之客 拳套
    [1482076, 30, 1], // 二代不速之客 指节
    [1492076, 30, 1], // 二代不速之客短枪
    [1302145, 20, 1], // 三代不速之客单手剑
    [1312060, 20, 1], // 三代不速之客单手斧
    [1322088, 20, 1], // 三代不速之客单手钝器
    [1332118, 20, 1], // 三代不速之客短剑-运
    [1332123, 20, 1], // 三代不速之客短剑-力
    [1342031, 20, 1], // 三代不速之客刀
    [1372076, 20, 1], // 三代不速之客短杖
    [1382097, 20, 1], // 三代不速之客长杖
    [1402088, 20, 1], // 三代不速之客双手剑
    [1412060, 20, 1], // 三代不速之客双手斧
    [1422061, 20, 1], // 三代不速之客双手钝器
    [1432079, 20, 1], // 三代不速之客枪
    [1442109, 20, 1], // 三代不速之客矛
    [1452104, 20, 1], // 三代不速之客弓
    [1462089, 20, 1], // 三代不速之客弩
    [1472115, 20, 1], // 三代不速之客 拳套
    [1482077, 20, 1], // 三代不速之客 指节
    [1492077, 20, 1], // 三代不速之客短枪
    [1082145, 30, 1], //工地手套(黄)
    [1082146, 30, 1], //工地手套(红)
    [1082147, 30, 1], //工地手套(蓝)
    [1082148, 30, 1], //工地手套(紫)
    [1082149, 5, 1], //工地手套(褐)
    [1082150, 30, 1], //工地手套(灰)
    [2070006, 3, 1], //齿轮镖
    [2070007, 2, 1], //月牙标
    [1312056, 30, 1], //黄金枫叶斧子
    [1332114, 30, 1], //黄金枫叶短刀
    [1342028, 30, 1], //黄金枫叶双刀
    [1372071, 30, 1], //黄金枫叶短杖
    [1402039, 30, 1], //黄金枫叶长杖
    [1472111, 30, 1], // 黄金枫叶拳套
    [1412011, 30, 1], //黄金枫叶双手剑
    [1322084, 30, 1], //黄金枫叶锤
    [1492073, 30, 1] // 黄金枫叶短枪
 



];


var Tickets = [
    { ItemID: 5220040, NUM:1,   NX: 1,    log: "  1个蛋"},
    { ItemID: 5220040, NUM:10,  NX: 9,   log: " 10个蛋"},
    { ItemID: 5220040, NUM:50,  NX: 40,   log: " 50个蛋"},
    { ItemID: 5220040, NUM:100, NX: 70,  log: "100个蛋"}];

function action(mode, type, selection) {
    /*if(!cm.getPlayer().isGM()){
        cm.sendOk("调试中");
        cm.dispose();
        return;
    }*/
    if (mode == 1) {
        status++;
    }
    if (status == 0) {
			var 飞天猪积分 = cm.getBossRankCount7("ftzjf");
			if (飞天猪积分 < 0) {
				飞天猪积分 = 0
			}
        var text = ""+numArr[1]+"#e#r：抽奖可以获得我肚子里的礼物，快行动吧#l\r\n";
		text += ""+numArr[2]+"#e#r：每次抽奖额外赠送1黄金枫叶，1抽奖积分#l\r\n";
        text +=""+numArr[3]+"：飞天猪积分：#r"+飞天猪积分+"#k\r\n\r\n";
        
        text += "#d#L3#马上购买#v5220040#进行抽奖；#l\r\n";
        text += "#d#L1##v5220040#抽取#r一#d次；#l\r\n";
        text += "#d#L2##v5220040#连取#r十#d次；#l\r\n\r\n";
		text += "#d#L4#"+小蓝星+"积分兑换"+小蓝星+"#l\r\n\r\n";
		text += "#d#L5#"+金币图标+"金币抽奖"+金币图标+"#l\r\n\r\n";
        
        text += "  #d-------------------------------------------\r\n";
		text += "  #d奖池如下：\r\n\r\n"
        for (var i = 0; i < itemList.length;  i++){
            text += "#i"+itemList[i][0]+":#";
        }

        cm.sendSimple(text);
    } else if (status == 1) {

            if (selection === 1) {
                doLottery(null, 100, 1)
            } else if (selection === 2) {
                doLottery(null, 100, 10)
            } else if (selection === 3){
				元宝 = getmoney();
                var msg = "#b当前账户存在：#r"+元宝+"#k#b元宝   请选择需要购买的数量：\r\n\r\n";
                for (i = 0; i < Tickets.length; i++) {
                    msg += "#b#L" + i + "#";
                    msg += "#v" + Tickets[i].ItemID + "#" + Tickets[i].log + "，需要元宝：#r" + Tickets[i].NX+ "#k#l\r\n";
                }
                cm.sendSimple("" + msg + "");
            }else if (selection === 4) {
                cm.dispose();
                cm.openNpc(9050001, "积分兑换");
            }else if (selection === 5) {
                cm.dispose();
                cm.openNpc(9050001, "金币抽奖");
            }
    }else if(status == 2){
		元宝 = getmoney();
        index = selection;
        if (!cm.canHold(Tickets[index].ItemID)) {
            cm.sendNext("#r背包空间不足！");
            cm.dispose();
            return;
        }
        if (元宝 < Tickets[index].NX) {
            cm.sendNext("元宝不足，无法购买！");
            cm.dispose();
            return;
        }
        cm.sendYesNo("#b是否要花费#r" + Tickets[index].NX + "#k#l#b元宝购买#r #v" + Tickets[index].ItemID+ "##r" + Tickets[index].NUM+ "#k#l#b个？#k#l\r\n");
    }else if(status == 3){
        改变元宝(-Tickets[index].NX);
        cm.getPlayer().dropMessage(5, "元宝：-" + Tickets[index].NX);
        cm.gainItem(Tickets[index].ItemID,Tickets[index].NUM);
        cm.sendNext("#b恭喜您，成功购买#v" + Tickets[index].ItemID + "#" + Tickets[index].NUM +"个!");
        cm.dispose();
    }
}

function doLottery(cailiao, meso, times) {

 

    var chance;
    var Xms1 = 0;
    var Xms2 = new Array();
    for (var j = 0; (j < times);) {

        chance = Math.floor(Math.random() * 200);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
		    if(itemList[i][1] == 0){
                //概率设置为0的是不可抽中的
                continue;
            }

            if (itemList[i][1] >= chance) {//防止概率为0的装备也抽中,前面已经过滤掉概率为0的了
                finalitem.push(itemList[i]);
            }
        }

        if (cailiao) {
            if (!cm.haveItem(cailiao, 1)) {
                cm.sendOk("#v" + cailiao + "#不足！");
                cm.dispose();
                return;
            }
        } else {
            if (!cm.haveItem(5220040,1)) {
                cm.sendOk("蛋蛋1个都没有");
                cm.dispose();
                return;
            }
        }

        if (finalitem.length != 0) {

            if (cm.getInventory(1).isFull(3) || cm.getInventory(2).isFull(3) || cm.getInventory(3).isFull(3) || cm.getInventory(4).isFull(3) || cm.getInventory(5).isFull(3)) {
                cm.sendNext("背包空间不足或你无法获得道具，抽奖终止！每栏都要留出至少3个格子");
                cm.dispose();
                return;
            }

            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            
			if(notice==2){
            item = cm.gainGachaponItem3(itemId, quantity, "快乐飞天猪抽奖", 2);
            }else{
			item = cm.gainGachaponItem3(itemId, quantity, "快乐飞天猪抽奖", 1);
			}
			cm.getPlayer().dropMessage(5, "飞天猪积分：+1");
			cm.setBossRankCount7("ftzjf", 1);
			cm.gainItem(4000313, 1);//每次抽奖给他一个物品
            if (item != -1) {
               
                Xms2[Xms1] = new Array();
                Xms2[Xms1][0] = itemId;
                Xms2[Xms1][1] = quantity;


                if (cailiao) {
                    cm.gainItem(cailiao, -1);
                } else {
                    
                    cm.gainItem(5220040,-1)
                }
                Xms1++;
                j++;
                if (times == 1) {
                    cm.gainItem(itemId, 0);
                    cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
                    cm.dispose();
                }

            }
        }
    }
    cm.dispose();
}
function getmoney() {
	accid = cm.getPlayer().getAccountID();
	xmfhz = 0;
	var conn = Packages.database.DatabaseConnection.getConnection();
	var sql = "SELECT * FROM accounts WHERE id = "+accid+"   ;";
	var pstmt = conn.prepareStatement(sql);
	var result = pstmt.executeQuery();
	if (result.next()) {
	xmfhz = result.getString("money");
	}
	result.close();
	pstmt.close();	
	return xmfhz;
}
function 改变元宝(xiezhi) {
	accid = cm.getPlayer().getAccountID();
    var conn = Packages.database.DatabaseConnection.getConnection();
	var sql = "UPDATE accounts SET money = money+"+xiezhi+"  WHERE id = "+accid+"  ;";
    var pstmt = conn.prepareStatement(sql);
	pstmt.executeUpdate();
	pstmt.close();
}
var 小蓝星 = "#fEffect/CharacterEff/1112925/0/0#"; 
var 金币图标 = "#fUI/UIWindow.img/Item/BtCoin/normal/0#";
var numArr = Array("#fUI/Basic.img/LevelNo/0#","#fUI/Basic.img/LevelNo/1#","#fUI/Basic.img/LevelNo/2#","#fUI/Basic.img/LevelNo/3#","#fUI/Basic.img/LevelNo/4#","#fUI/Basic.img/LevelNo/5#","#fUI/Basic.img/LevelNo/6#","#fUI/Basic.img/LevelNo/7#","#fUI/Basic.img/LevelNo/8#","#fUI/Basic.img/LevelNo/9#");