var 蓝色角点 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var 感叹号 = "#fUI/UIWindow/Quest/icon0#";
function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			text += "\t\t\t\t#e#r超值理财#e#b中心欢迎您\r\n"
			text += "\t"+"您目前拥有:"+cm.getmoneyb()+"元宝"
			text += "\t#e#r一元=1元宝\r\n"



			text += "\r\n"+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+"\r\n"
			//text += "#rNo.1 经济理财 #v1112140#[四属性+10，攻魔+10] 7天权\r\n#e#b价格:50充值币/周 \r\n"
			//text += "#rNo.1 豪华理财 #v1112139#[四属性+30，攻魔+30] 永久权\r\n#e#b价格:150充值币/月\r\n\r\n"
			//text += ""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+"\r\n"

			text += "#r 理财特权:\r\n#b1.每日领取#v1112138#[四属性+20，攻魔+20]（24小时）\r\n#b2.每日领取#v1112245#[四属性+20，攻魔+20]（24小时）\r\n#b3.每日领取金币一千万\r\n4.每日领取点券3000点\r\n5.每日领取抵用卷3000点\r\n6.每日领取强化混沌卷轴5张\r\n7.每日领取祝福卷轴5张\r\n"
			text += "#b\r\n8.每日领取双倍经验卡（24小时）\r\n#b9.每日领取双倍爆率卡（24小时）\r\n#b10.免费自选发型\r\n11.免费自选脸型\r\n12.老公老婆戒指升级系统\r\n13.更多服务等待添加\r\n"
			text += "\r\n"+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+"\r\n"
			
			//text += "\t#L3##e#r购买超值理财七天权(50充值币)#l \r\n\r\n"

			text += "\t#L5##r购买超值理财三十天权 需要 (150元宝)#l\r\n\r\n"
			text += "\r\n"+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+""+蓝色角点+"\r\n"

			//if(cm.haveItem(3700148,1) && cm.haveItem(3700149,1) && cm.haveItem(3700150,1)){
			//	if(cm.haveItem(2022615,1) ){
			//	cm.sendOk("您已经办理了一个理财会员,请到期后再来找我~!");
			//} else {
				cm.sendSimple(text);
		 
			}
         if (selection == 1) {
			if(cm.getmoneyb() >= 100){
			 cm.setmoneyb(-100);
			 cm.gainItem(3700150,1,720);	
cm.全服漂浮喇叭("恭喜玩家["+cm.getName()+"]已经成功购买理财会员一个月~!", 5121005);
				cm.dispose();
			} else {
				cm.sendOk("您的充值币不足~!请充值！");
            cm.dispose();
			}
				}else if  (selection == 2) {
				if(cm.getmoneyb() >= 30){
					cm.setmoneyb(-30);
			 cm.gainItem(3700150,1,168);

cm.全服漂浮喇叭("恭喜玩家["+cm.getName()+"]已经成功购买理财会员一个周~!", 5121005);
				cm.dispose();
			} else {
				cm.sendOk("您的充值币不足~!请充值！");
            cm.dispose();
			}


}else if  (selection == 3) {				
if(cm.haveItem(2022615,1) ){
cm.sendOk("您已经办理了一个理财会员,请到期后再来找我~!");
	} else {		
		if(cm.getmoneyb() >= 50){
					//cm.setmoneyb(-50);
					cm.gainItem(2022615,1,7);
					//cm.gainItem(3700149,1,720);
			 //cm.gainItem(1112140,10,10,10,10,0,0,10,10,0,0,0,0,0,0,168);
cm.全服漂浮喇叭("恭喜玩家["+cm.getName()+"]已经成功购买经济理财会员一周权~!", 5121006);
				cm.dispose();
			} else {
				cm.sendOk("您的充值元宝不足~!请充值！");
            cm.dispose();
			}
	}

}else if  (selection == 5) {
if(cm.haveItem(2022615,1) ){
cm.sendOk("您已经办理了一个理财会员,请到期后再来找我~!");
	} else {	
		if(cm.getmoneyb() >= 150){
					cm.setmoneyb(-150);
					cm.gainItem(2022615,1,30);//30天
					//cm.gainItem(3700148,1,720);
			 //cm.gainItem(1112139,30,30,30,30,0,0,30,30,0,0,0,0,0,0,720);		
cm.全服漂浮喇叭("恭喜玩家["+cm.getName()+"]已经成功购买豪华理财会员一个月~!", 5121007);
				cm.dispose();
			} else {
				cm.sendOk("您的充值币不足~!请充值！");
            cm.dispose();
			}
	}



}else if  (selection == 6) {
if(cm.haveItem(2022615,1) ){
cm.sendOk("您已经办理了一个理财会员,请到期后再来找我~!");
	} else {	if(cm.getmoneyb() >= 90){
					cm.setmoneyb(-90);
			 cm.gainItem(3700148,1,168);			 
//cm.全服漂浮喇叭("恭喜玩家["+cm.getName()+"]已经成功购买理财会员一个周~!", 5121006);
				cm.dispose();
			} else {
				cm.sendOk("您的充值币不足~!请充值！");
            cm.dispose();
			}
				}				
			}
		}
}
