status = -1;
var itemList = Array(
        Array(4001137, 911, 1, 0), //乖寶寶印章
        Array(4001137, 1, 1, 0), //乖寶寶印章
        Array(2022251, 840, 4, 0), //楓葉棒棒糖
        Array(2022245, 880, 4, 0), //心跳停止糖
        Array(2022220, 860, 1, 0), //拉圖斯的御守
        Array(2022216, 860, 1, 0), //菇菇寶貝的御守
        Array(2022217, 860, 1, 0), //殘暴炎魔的御守	
        Array(1102033, 780, 1, 0), //紅龍紋披風
        Array(1102034, 780, 1, 0), //藍龍紋披風
        Array(1102035, 780, 1, 0), //黑龍紋披風
        Array(1002871, 400, 1, 0), //麋鹿角
        Array(1002872, 400, 1, 0), //麋鹿角
        Array(1002873, 400, 1, 0), //麋鹿角
        Array(1002874, 400, 1, 0), //麋鹿角
        Array(1082145, 550, 1, 0), //黃色工作手套
        Array(1082146, 550, 1, 0), //紅色工作手套
        Array(1082147, 550, 1, 0), //藍色工作手套
        Array(1082148, 500, 1, 0), //紫色工作手套
        Array(1002602, 500, 1, 0), //藍色楓葉頭帶
        Array(2022133, 500, 1, 0), //年年有餘
        Array(1322051, 350, 1, 0), //七夕彩竹
        Array(1302110, 350, 1, 0), //火柴
        Array(1302111, 350, 1, 0), //叉子
        Array(1382015, 400, 1, 0), //毒之菇
        Array(1382038, 350, 1, 0), //糖葫蘆
        Array(1472054, 400, 1, 0), //信玄
        Array(1372017, 400, 1, 0), //路燈
        Array(1302031, 350, 1, 0), //七星劍
        Array(1102040, 400, 1, 0), //黃色冒險家披風
        Array(1032017, 500, 1, 0), //玫瑰耳環
        Array(1032023, 500, 1, 0), //草莓耳環
        Array(1072262, 500, 1, 0), //黑色桃樂斯皮鞋
        Array(2340000, 30, 1, 1), //祝福卷軸
        Array(1452167, 100, 1, 1), //金剛不壞小雞
        Array(1004096, 120, 1, 1), //新春舞獅(頭)
        Array(1032129, 100, 1, 1), //許願樹傳說耳環
        Array(1112672, 80, 1, 1), //傳說楓葉銀之戒
        Array(1142698, 120, 1, 1), //新年目標王
        Array(1003114, 60, 1, 1), //神龍頭盔
        Array(1102248, 50, 1, 1), //神龍披風
        Array(1012170, 20, 1, 1), //鬼娃恰吉的傷口
		Array(1012171, 10, 1, 1), //鬼娃恰吉的傷口
        Array(3010755, 120, 1, 1), //天鵝便桶
        Array(3010756, 120, 1, 1), //飯桶招財貓
        Array(3010608, 100, 1, 1), //名畫椅子
        Array(3010593, 100, 1, 1), //小姐小姐新年到～
        Array(3010622, 100, 1, 1), //我的好友丹金椅
        Array(3010624, 120, 1, 1), //電視椅
        Array(3010642, 100, 1, 1), //重新上色的畫
        Array(3010664, 100, 1, 1), //進化椅子
        Array(3010675, 100, 1, 1), //斑斑的憤怒
        Array(3010682, 100, 1, 1), //天文台椅子
        Array(3010601, 120, 1, 1), //黑貓籃椅
        Array(3010688, 120, 1, 1), //實驗室椅子
        Array(3010716, 120, 1, 1), //超級菇菇椅子
        Array(3010721, 120, 1, 1), //漫畫書椅子
        Array(3010722, 120, 1, 1), //殭屍狩獵者椅子
        Array(3010609, 120, 1, 1), //時尚潮男椅
        Array(3010757, 80, 1, 1), //你跟我
        Array(3010754, 120, 1, 1), //百鬼夜行
        Array(3010766, 120, 1, 1), //尖耳木椅
        Array(3010799, 80, 1, 1), //墳墓椅
        Array(3010810, 100, 1, 1), //火車旅行椅子
        Array(3010863, 100, 1, 1), //憤怒的美容院椅子
        Array(3015331, 80, 1, 1), //貓咪紙屋
        Array(1322001, 100, 1, 1), //槌子
        Array(1322006, 100, 1, 1), //鋼管
        Array(1142374, 100, 1, 1), //聖誕奇蹟
        Array(1032128, 120, 1, 1), //許願樹金耳環
        Array(1132103, 120, 1, 1), //黃金腰帶
        Array(1022162, 110, 1, 1), //旅行者的翅膀造型眼鏡
        Array(1112596, 110, 1, 1), //拉爾孫的挑戰型戒指
        Array(1004579, 100, 1, 1), //乖巧羊帽子
        Array(1012310, 200, 1, 1), //情人甜美巧克力
        Array(1082514, 110, 1, 1), //情人節手環<下級>
        Array(1142681, 120, 1, 1), //守護情侶的單身
        Array(1142713, 120, 1, 1), //非自發性的單身主義者
        Array(1012164, 200, 1, 1), //鬼娃恰吉的傷口
        Array(1012167, 140, 1, 1), //鬼娃恰吉的傷口
        Array(1012168, 80, 1, 1), //鬼娃恰吉的傷口
        Array(1012169, 20, 1, 1), //鬼娃恰吉的傷口
        Array(1402044, 100, 1, 1), //南瓜燈籠
        Array(1003439, 140, 1, 1), //情人節氫氣球
        Array(1002596, 100, 1, 1), //小狗帽子
        Array(1002723, 100, 1, 1), //年糕帽
        Array(1032028, 200, 1, 1), //紅祖母綠耳環
        Array(1032194, 160, 1, 1), //里貝卡的葡萄耳環
        Array(1122109, 160, 1, 1), //葡萄項墜
        Array(1052350, 140, 1, 1), //小丘運動服
        Array(1082533, 140, 1, 1), //愛里涅的手鐲
        Array(1102590, 100, 1, 1), //愛里捏的翅膀
        Array(1092035, 100, 1, 1), //可樂戰盾
        Array(1102370, 160, 1, 1), //西格諾斯粉絲俱樂部氣球
        Array(1102371, 160, 1, 1), //巴雷利粉絲俱樂部氣球
        Array(1102372, 150, 1, 1), //莉琳粉絲俱樂部氣球
        Array(1302145, 160, 1, 1), //3rd 不速之客 單手劍
        Array(1332123, 160, 1, 1), //3rd 不速之客 短劍
        Array(1372076, 160, 1, 1), //3rd 不速之客 杖
        Array(1382097, 160, 1, 1), //3rd 不速之客 長杖
        Array(1402088, 160, 1, 1), //3rd 不速之客 雙手劍
        Array(1432079, 160, 1, 1), //3rd 不速之客槍
        Array(1442109, 160, 1, 1), //3rd 不速之客 矛
        Array(1452104, 160, 1, 1), //3rd 不速之客 弓
        Array(1462089, 160, 1, 1), //3rd 不速之客 弩
        Array(1472115, 160, 1, 1), //3rd 不速之客 拳套
        Array(1482077, 160, 1, 1), //3rd 不速之客 指虎
        Array(1492077, 160, 1, 1), //3rd 不速之客 火槍
        Array(1382045, 80, 1, 1), //火雲長杖
        Array(1382046, 120, 1, 1), //毒龍長杖
        Array(1382047, 80, 1, 1), //冰魄長杖
        Array(1382048, 120, 1, 1), //朱雀長杖
        Array(1132049, 150, 1, 1), //力氣褐色鎖扣腰帶
        Array(1132059, 150, 1, 1), //智慧褐色鎖扣腰帶
        Array(1132069, 150, 1, 1), //鋒利褐色鎖扣腰帶
        Array(1132079, 150, 1, 1), //幸運褐色鎖扣腰帶
        Array(1122297, 120, 1, 1), //橘子項鍊
        Array(1142260, 100, 1, 1), //新手楓葉轉蛋券勳章
        Array(1002931, 140, 1, 1), //蕃茄帽子(力量)
        Array(1002932, 140, 1, 1), //蕃茄帽子(敏捷)
        Array(1002933, 140, 1, 1), //蕃茄帽子(智力)
        Array(1002934, 140, 1, 1), //蕃茄帽子(幸運)
        Array(1052191, 140, 1, 1), //蕃茄服裝
        Array(1142073, 120, 1, 1), //和我做朋友勳章
        Array(1142376, 120, 1, 1), //神出鬼沒
        Array(1012056, 120, 1, 1), //狗鼻
        Array(1102234, 120, 1, 1), //奇多豹掌氣球
        Array(1002799, 120, 1, 1), //桂冠
        Array(1302087, 140, 1, 1), //獎盃武器
        Array(1032127, 150, 1, 1), //許願樹銀耳環
        Array(1112915, 150, 1, 1), //歡樂指環
        Array(1022047, 120, 1, 1), //貓頭鷹
        Array(1102042, 150, 1, 1), //紫色冒險家披風
        Array(1142207, 160, 1, 1), //春花胸針
        Array(1092022, 120, 1, 1), //調色盤
        Array(1302061, 120, 1, 1), //樹藤鞭子
        Array(1332101, 120, 1, 1), //奇多豹掌武器
        Array(1422068, 120, 1, 1), //奇多豹掌棍
        Array(2043305, 160, 1, 1), //短劍攻擊詛咒卷軸30%
        Array(2044804, 160, 1, 1), //指虎攻擊詛咒卷軸30%
        Array(1112922, 150, 1, 1), //奇多豹掌戒指
        Array(1082149, 140, 1, 1), //褐色工作手套
        Array(1072798, 140, 1, 1), //妖精的紅色帆布鞋
        Array(1082179, 140, 1, 1), //黃擊中手套
        Array(1004379, 170, 1, 1), //橘子帽子
        Array(1004380, 170, 1, 1), //橘子帽子
        Array(1004381, 170, 1, 1), //橘子帽子
        Array(1004382, 170, 1, 1), //橘子帽子
        Array(1102041, 140, 1, 1), //粉紅冒險家披風
        Array(1302024, 100, 1, 1), //紙劍
        Array(1302021, 100, 1, 1), //橡皮榔頭
        Array(2043005, 130, 1, 1), //單手劍攻擊詛咒卷軸30%
        Array(2043205, 160, 1, 1), //單手棍攻擊詛咒卷軸30%
        Array(2044405, 130, 1, 1), //矛攻擊詛咒卷軸30%
        Array(2044505, 130, 1, 1), //弓攻擊詛咒卷軸30%
        Array(2044705, 130, 1, 1), //拳套攻擊詛咒卷軸30%
        Array(2043805, 130, 1, 1), //長杖魔力詛咒卷軸30%
        Array(2043705, 130, 1, 1), //短杖魔力詛咒卷軸30%
        Array(2044904, 130, 1, 1), //火槍攻擊詛咒卷軸30%
        Array(2040509, 140, 1, 1), //套服敏捷詛咒卷軸30%
        Array(2040521, 140, 1, 1), //套服幸運詛咒卷軸30%		
        Array(2044305, 160, 1, 1), //槍攻擊詛咒卷軸30%		
        Array(2044605, 160, 1, 1), //弩攻擊詛咒卷軸30%		
        Array(1132088, 140, 1, 1), //葡萄腰帶
        Array(1122019, 130, 1, 1), //楓葉之心
        Array(1012484, 100, 1, 1), //雙十紀念喇叭
        Array(1122209, 120, 1, 1), //黃金月餅項鍊
        Array(1012070, 160, 1, 1), //草莓冰棒
        Array(2040519, 120, 1, 1), //套服智力詛咒卷軸30%
        Array(2040533, 120, 1, 1), //套服力量詛咒卷軸30%
        Array(1372035, 140, 1, 1), //旋火短杖
        Array(1372036, 200, 1, 1), //五毒短杖
        Array(1372037, 140, 1, 1), //極凍短杖
        Array(1372038, 200, 1, 1), //雷鳴短杖
        Array(1302001, 100, 1, 1), //鋸
        Array(1302037, 100, 1, 1), //喇叭
        Array(1302080, 100, 1, 1), //楓葉小電燈
        Array(1302105, 120, 1, 1), //聖誕節天使
        Array(1302132, 100, 1, 1), //打豬棒
        Array(1302150, 100, 1, 1), //魔女掃把
        Array(1302201, 100, 1, 1), //福袋
        Array(1322070, 100, 1, 1), //西班牙火腿
        Array(1322225, 100, 1, 1), //衝擊波來福
        Array(1332030, 100, 1, 1), //扇子
        Array(1322023, 140, 1, 1), //藍花紋游泳圈
        Array(1322024, 140, 1, 1), //紫游泳圈
        Array(1322025, 140, 1, 1), //救生圈
        Array(1302293, 140, 1, 1), //粉紅色游泳圈
        Array(3010298, 140, 1, 1), //北極熊椅子
        Array(3010048, 140, 1, 1), //耶誕樹椅子
        Array(3010049, 140, 1, 1), //冰窖椅
        Array(3010061, 100, 1, 1), //楓樹下
        Array(3010135, 100, 1, 1), //獨角獅椅子
        Array(3010140, 100, 1, 1), //病床
        Array(3010223, 100, 1, 1), //柯基犬椅子
        Array(3010224, 100, 1, 1), //麻糬冰淇淋椅
        Array(3010433, 100, 1, 1), //魔法皮卡啾
        Array(3010447, 100, 1, 1), //好睏啊鳥椅子
        Array(3010449, 100, 1, 1), //治好要10週椅子
        Array(3010453, 100, 1, 1), //乘著暴風的兔子椅
        Array(3010454, 140, 1, 1), //愛心雲朵椅
        Array(3010584, 140, 1, 1), //聖誕幽靈
        Array(1113076, 160, 1, 1), //最初的戒指
        Array(1072447, 160, 1, 1), //雪冰的鞋
        Array(1082276, 160, 1, 1), //雪冰的手套
        Array(1102246, 160, 1, 1), //雪冰的披風
        Array(1132140, 160, 1, 1), //溫暖的腹帶
        Array(3010038, 120, 1, 1), //透明椅
        Array(3010170, 120, 1, 1), //飄雪的夜晚
        Array(3010174, 120, 1, 1), //魔女椅子
        Array(3010175, 120, 1, 1), //小畫家椅
        Array(3010298, 120, 1, 1), //北極熊椅子
        Array(3010288, 120, 1, 1), //珍珠蚌椅子
        Array(3010107, 120, 1, 1), //龍蛋		
        Array(3010149, 100, 1, 1), //涼夏貓咪椅
        Array(3010096, 120, 1, 1), //恐龍化石寶座
        Array(3010068, 120, 1, 1), //荷葉下椅子
        Array(3010196, 120, 1, 1), //泡泡浴缸椅
        Array(3010025, 120, 1, 1), //楓樹下
        Array(3010031, 100, 1, 1), //紅色五環椅
        Array(3010045, 100, 1, 1), //冰椅
        Array(3010051, 100, 1, 1), //公砂兔椅
        Array(3010046, 100, 1, 1), //赤龍椅
        Array(3010047, 100, 1, 1), //藍龍椅
        Array(3010120, 100, 1, 1), //兔子籃子椅子		
        Array(3010052, 100, 1, 1), //母砂兔椅
        Array(3010029, 100, 1, 1), //藍色五環椅
        Array(3010030, 100, 1, 1), //黑色五環椅		
        Array(3010802, 100, 1, 1), //國中生月妙磕頭椅子
        Array(3010804, 100, 1, 1), //軍人月妙磕頭椅子
        Array(3010600, 100, 1, 1), //福寶月妙椅子
        Array(3010316, 100, 1, 1), //走吊鋼絲的月妙方椅
        Array(3010210, 100, 1, 1), //草莓冰淇淋月餅椅子
        Array(3010440, 100, 1, 1), //找到故鄉的月妙椅子
        Array(3010705, 100, 1, 1), //月妙和綠水靈椅
        Array(3010172, 100, 1, 1), //星空夜晚
        Array(3010043, 100, 1, 1), //女巫掃把
        Array(3010717, 100, 1, 1), //一克拉婚戒戒指	
        Array(3010070, 30, 1, 1), //皮卡啾椅子
        Array(3010014, 30, 1, 1)//彎彎月亮
        );

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
                    "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063#  #i3994071##i3994077#\r\n" +
                    "        #r此為泡泡谷轉蛋機，您不想轉蛋嗎？");
            cm.dispose();
        }
        status--;
    }

    if (status == 0) {
        if (cm.getPlayer().getLevel() < 50) {
            cm.sendOk("\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
                    "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063#  #i3994071##i3994077#\r\n" +
                    "        #r此為泡泡谷轉蛋機，需要50等才能抽獎。");
            cm.dispose();
        } else if (cm.haveItem(5220000)) {
            cm.sendYesNo("\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
                    "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063#  #i3994071##i3994077#\r\n" +
                    "           #r此為泡泡谷轉蛋機，你要轉蛋嗎?#k\r\n");
        } else {
            cm.sendOk("\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
                    "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063#  #i3994071##i3994077#\r\n" +
                    "       #r此為泡泡谷轉蛋機，請到商城購買轉蛋卷。#k\r\n");
            cm.safeDispose();
        }
    } else if (status == 1) {

        var chance = Math.floor(Math.random() * 1000);
        if (chance > 911) {
            chance = 911;
        }
        if (chance < 1) {
            chance = 911;
        }
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            if (cm.haveItem(5220000) && cm.canHold()) {
                if (itemId == 1142374 || itemId == 1112596 || itemId == 1142681 || itemId == 1122297 || itemId == 1142260 || itemId == 1142073 || itemId == 1142376 || itemId == 1012484 || itemId == 1302201 || itemId == 1113076) {
                    if (cm.haveItem(1142374) || cm.haveItem(1112596) || cm.haveItem(1142681) || cm.haveItem(1122297) || cm.haveItem(1142260) || cm.haveItem(1142073) || cm.haveItem(1142376) || cm.haveItem(1012484) || cm.haveItem(1302201) || cm.haveItem(1113076)) {

                    } else {
                        cm.gainItem(5220000, -1);
                    }
                } else {
                    cm.gainItem(5220000, -1);
                }

                if (notice == 1) {
                    cm.gainGachaponItem(itemId, quantity, "潮流轉蛋機");
                } else {
                    cm.gainItem(itemId, quantity);
                }

                if (itemId == 1142374 || itemId == 1112596 || itemId == 1142681 || itemId == 1122297 || itemId == 1142260 || itemId == 1142073 || itemId == 1142376 || itemId == 1012484 || itemId == 1302201 || itemId == 1113076) {
                    if (cm.haveItem(1142374) || cm.haveItem(1112596) || cm.haveItem(1142681) || cm.haveItem(1122297) || cm.haveItem(1142260) || cm.haveItem(1142073) || cm.haveItem(1142376) || cm.haveItem(1012484) || cm.haveItem(1302201) || cm.haveItem(1113076)) {
                        cm.getItemLog("潮流轉蛋機", " 抽到專屬道具 " + itemId + "(" + cm.getItemName(itemId) + ") " + quantity + "個。");
                        cm.sendOk("\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
                                "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063#  #i3994071##i3994077#\r\n" +
                                " #r此為泡泡谷轉蛋機，恭喜你得到了#k #b#t" + itemId + "##k #r" + quantity + "個。此物品為專屬道具，您背包有此物品，無法獲得，請再試。本次不會扣轉蛋卷#k");
                    } else {
                        cm.getItemLog("潮流轉蛋機", " 抽到 " + itemId + "(" + cm.getItemName(itemId) + ") " + quantity + "個。");
                        cm.sendOk("\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
                                "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063#  #i3994071##i3994077#\r\n" +
                                " #r此為泡泡谷轉蛋機，恭喜你得到了#k #b#t" + itemId + "##k #r" + quantity + "個。#k");
                    }
                } else {
                    cm.getItemLog("潮流轉蛋機", " 抽到 " + itemId + "(" + cm.getItemName(itemId) + ") " + quantity + "個。");
                    cm.sendOk("\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
                            "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063#  #i3994071##i3994077#\r\n" +
                            " #r此為泡泡谷轉蛋機，恭喜你得到了#k #b#t" + itemId + "##k #r" + quantity + "個。#k");
                }


            } else {
                cm.sendOk("請確認背包是否已經滿了以及是否有轉蛋卷唷。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("出現未知問題，請稍後再試。");
            cm.safeDispose();
        }
    } else {
        cm.dispose();
    }
}