/* global cm */

var status = -1;
var select = -1;

function start() {
    cm.sendOk(
            "\t\t #i3994014##i3994018##i3994070##i3994061##i3994005##i3991038##i3991004#\r\n" +
            "\t  #i3994060##i3994079##i3994060##i3994060##i3994070##i3994063##i3994071##i3994077#\r\n" +
            "    #d此为芒果冒险岛玩家指令整合#k\r\n" +
            //"#b@清除道具 <裝備欄/消耗欄/裝飾欄/其他欄/特殊欄><開始格數> <結束格數>#k  -  #r<清除背包道具>#k\r\n" +
			"#b@帮助#k  -  #r<查看可以使用的指令>#k\r\n" +
            "#b@查看/@ea#k  -  #r<解卡异常状态，查看系统信息>#k\r\n" +
            "#b@怪物/@Mob#k  -  #r<查看身旁怪物信息>#k\r\n" +           
			"#b@fm#k  -  #r<回到自由市场，部分地图无法使用#k\r\n" +
            "#b@Cgm#k  -  #r<发信息给在线管理员>#k\r\n" +
            //"#b@expfix#k  -  #r<使玩家經驗歸0>#k\r\n" +
            //"#b@Event#k  -  #r<參加活動>#k\r\n" +
            //"#b@Tsmega#k  -  #r<開/關所有廣播>#k\r\n"

            );
    cm.dispose();
}
