/**
**回收脚本
**/
var ttt1 = "#fEffect/CharacterEff/1062114/1/0#";  //爱心
var add = "#fEffect/CharacterEff/1112903/0/0#";//红桃心
var 四方印 = "#fUI/GuildMark/Mark/Pattern/00004014/11#"; // 紫色四方印
var 装备回收列表=[
1092030,
1092046, 
1092047, 
1452040, 
1452100, 
1302013, 
1302016, 
1302017, 
1302021, 
1302024, 
1302025, 
1302026, 
1302027, 
1302028, 
1302029, 
1302035, 
1302049, 
1302071, 
1302080, 
1302129, 
1312012, 
1312013, 
1312014, 
1322012, 
1322021, 
1322022, 
1322023, 
1322024, 
1322025, 
1322026, 
1322027, 
1322031, 
1332021, 
1332024, 
1332032, 
1332056, 
1402013,
1402014, 
1422011, 
1432009,
1432008, 
1432013, 
1432015, 
1432016, 
1432017, 
1432018, 
1442011, 
1442012, 
1442013, 
1442014, 
1442015, 
1442016, 
1442017, 
1442018, 
1442021, 
1442022, 
1442023, 
1442026, 
1442027, 
1442028, 
1442029, 
1442030, 
1442046, 
1462040, 
1082145,
1082146,
1082147,
1082148,
1082149,
1082150,
1082175,
1082176,
1082177, 
1082178, 
1082179, 
1102040, 
1102041, 
1102042, 
1102043, 
1102053, 
1102055, 
1102082, 
1102084, 
1102085, 
1102086, 
1102163, 
1072157, 
1072158, 
1072159, 
1072160,
1072872, 
1072239,
1012321, 
1012529, 
1012504, 
1012512, 
1012011, 
1012012, 
1012013, 
1012014, 
1012016, 
1012017, 
1012098, 
1012101, 
1012102, 
1012103, 
1012304, 
1012306, 
1012328, 
1012417, 
1012418,
1012419,
1022129,
1022132, 
1022134, 
1022135, 
1022160, 
1022161, 
1032032, 
1032026, 
1032077, 
1032078,
1032079,
1032098, 
1032099,
1032174,
1122109, 
1122119,
1122227, 
1122228, 
1132000, 
1132002, 
1132003, 
1132004, 
1012268, 
1012267,
1022047,
1022058,
1022060,
1032062, 
1122001,
1122002,
1122003,
1122004, 
1122005,
1122006,
1122019, 
1142230, 
1142231, 
1142232, 
1142234,
1142230, 
1132133, 
1132134,
1112598,
1112676,
1112677,
1112678, 
1112679, 
1052405, 
 1302142,
 1312056,
 1322084,
 1332114,
 1372071,
 1382093,
 1402085,
 1412055,
 1422057,
 1432075,
 1442104,
 1452100,
 1462085,
 1472111,
 1112444,
 1122075,
 1302064,
 1302145,
 1322088,
 1332118,
 1372076,
 1382097,
 1402088,
 1412060,
 1432079,
 1442109,
 1452104,
 1462089,
 1472115,
 1492077,
 1002517,
 1003110,
 1003111,
 1102441,
 1082343,
 1082344,
 1082345,
 1052461,
 1072660,
 1472018,
 1332003,
 1302020,
 1332018,
 1482007,
 1492007,
 1492008,
 1492009,
 1482008,
 1482009,
 1452004,
 1452012,
 1462009,
 1462010,
 1462018,
 1372015,
 1372016,
 1382010,
 1382035,
 1372007,
 1372015,
 1372016,
 1382010,
 1382035
];
var 装备回收积分=1;
var 卷轴回收列表=[2040013,
2040025,
2040026,
2040028,
2040029,
2040030,
2040031,
2040301,
2040302,
2040304,
2040305,
2040306,
2040307,
2040317,
2040318,
2040320,
2040321,
2040322,
2040323,
2040329,
2040330,
2040331,
2040401,
2040402,
2040404,
2040405,
2040406,
2040407,
2040408,
2040409,
2040418,
2040419,
2040421,
2040422,
2040424,
2040425,
2040426,
2040427,
2040501,
2040502,
2040504,
2040505,
2040508,
2040509,
2040510,
2040511,
2040513,
2040514,
2040516,
2040517,
2040518,
2040519,
2040520,
2040521,
2040531,
2040532,
2040533,
2040534,
2040601,
2040604,
2040605,
2040606,
2040607,
2040608,
2040609,
2040619,
2040624,
2040625,
2040626,
2040627,
2040701,
2040702,
2040704,
2040705,
2040707,
2040708,
2040712,
2040713,
2040714,
2040715,
2040716,
2040717,
2040727,
2040804,
2040805,
2040808,
2040809,
2040810,
2040811,
2040906,
2040907,
2040924,
2040925,
2040930,
2040931,
2040932,
2040933,
2041010,
2041011,
2041013,
2041014,
2041016,
2041017,
2041019,
2041020,
2041022,
2041023,
2041035,
2043001,
2043002,
2043005,
2043101,
2043102,
2043105,
2043201,
2043202,
2043205,
2043301,
2043302,
2043305,
2043701,
2043702,
2043705,
2043801,
2043802,
2043805,
2044001,
2044002,
2044005,
2044101,
2044102,
2044105,
2044201,
2044202,
2044205,
2044301,
2044302,
2044305,
2044401,
2044402,
2044405,
2044501,
2044502,
2044505,
2044601,
2044809,
2044602,
2044605,
2044701,
2044702,
2044705,
2044801,
2044802,
2044901,
2044902];
var 卷轴回收积分=1;
var 兑换机制=[
	100,300,500,1000,1500,2000,3000,4000,5000,6000
];
var 装备兑换=[
[1112789,100],//100积分可回收，对应回收机制
[1112792,300],//300积分可回收，对应回收机制
[1112764,500],//500积分可回收，对应回收机制
[1112768,1000],//1000积分可回收，对应回收机制
[1112772,1500],//1500积分可回收，对应回收机制
[1112776,2000],//2000积分可回收，对应回收机制
[1112763,3000],//3000积分可回收，对应回收机制
[1112767,4000],//4000积分可回收，对应回收机制
[1112771,5000],//5000积分可回收，对应回收机制
[1112775,6000]//6000积分可回收，对应回收机制
];
var 装备兑换数量=[
	[1],//100积分可回收，对应回收机制
	[1],//300积分可回收，对应回收机制
	[1],//500积分可回收，对应回收机制
	[1],//1000积分可回收，对应回收机制
	[1],//1500积分可回收，对应回收机制
	[1],//2000积分可回收，对应回收机制
	[1],//3000积分可回收，对应回收机制
	[1],//4000积分可回收，对应回收机制
	[1],//5000积分可回收，对应回收机制
	[1] //6000积分可回收，对应回收机制
];
var 卷轴兑换=[
	[4032391,100],//100积分可回收，对应回收机制
	[4032392,300],//300积分可回收，对应回收机制
	[2340000,500],//500积分可回收，对应回收机制
	[2049118,1000],//1000积分可回收，对应回收机制
	[4310027,1500],//1500积分可回收，对应回收机制
	[4310038,2000],//2000积分可回收，对应回收机制
	[4310034,3000],//3000积分可回收，对应回收机制
	[4310029,4000],//4000积分可回收，对应回收机制
	[4310148,5000],//5000积分可回收，对应回收机制
	[4251202,60000]//6000积分可回收，对应回收机制
];
var 卷轴兑换数量=[
	[30],//100积分可回收，对应回收机制
	[30],//300积分可回收，对应回收机制
	[5],//500积分可回收，对应回收机制
	[6],//1000积分可回收，对应回收机制
	[5],//1500积分可回收，对应回收机制
	[5],//2000积分可回收，对应回收机制
	[5],//3000积分可回收，对应回收机制
	[6],//4000积分可回收，对应回收机制
	[1],//5000积分可回收，对应回收机制
	[5] //6000积分可回收，对应回收机制
];
var fee=0;
var 物品坐标=0;
var 物品栏=0;
var 状态=0;
var status=-1;
var slot = Array();
var 兑换内部坐标=-1;
var 兑换坐标=-1;
function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
	if (status >= 0 && mode == 0) {
		cm.sendOk("感谢使用！");
		cm.dispose();
		return;
	}
    if (mode == -1) {
        cm.dispose();
    } else {
        if (mode == 1) {
            status++;
        } else {
            status--;
        }
		switch(status){
			case 0:
				var text="";
				text+="#e#d   亲爱的玩家 #r[#h ##k#r]#d,欢迎来到回收中心 #k\r\n\r\n";
				text+=""+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+四方印+"\r\n";
				text+="#e#d您目前拥有回收积分 ："+cm.getPlayer().getjf3()+"\r\n";
				text+="#e#r#L0#"+ttt1+"装备回收#l\r\n";
				text+="#e#r#L1#"+ttt1+"卷轴回收#l\r\n";
				text+="#e#r#L2#"+ttt1+"装备兑换#l\r\n";
				text+="#e#r#L3#"+ttt1+"卷轴兑换#l\r\n";
				cm.sendOk(text);
				break;
			case 1:
				fee=selection;
				switch(fee){
					case 0:
						物品栏=1;
						状态=1;
						var avail="#e#d可回收物品如下:\r\n";
						avail+="\t\t\t\t#e#r#L10000#一键回收所有#l\r\n";
						for (var i = 0; i < 装备回收列表.length; i++) {
							if(cm.haveItem(装备回收列表[i], 1)){
								avail += "\t\t#b#L"+i+"##v"+装备回收列表[i]+"##z"+装备回收列表[i]+"##r【可回收】#b#l\r\n";
							}else{
								avail += "\t\t#b#L"+i+"##v"+装备回收列表[i]+"##z"+装备回收列表[i]+"##r#b#l\r\n";
							}
						}
						cm.sendOk(avail);
						break;
					case 1:
						物品栏=2;
						状态=1;
						var avail="#e#d可回收物品如下:\r\n";
						avail+="\t\t\t\t#e#r#L10000#一键回收所有#l\r\n";
						for (var i = 0; i < 卷轴回收列表.length; i++) {
							if(cm.haveItem(卷轴回收列表[i], 1)){
								avail += "\t\t#b#L"+i+"##v"+卷轴回收列表[i]+"##z"+卷轴回收列表[i]+"##r【可回收】#b#l\r\n";
							}else{
								avail += "\t\t#b#L"+i+"##v"+卷轴回收列表[i]+"##z"+卷轴回收列表[i]+"##r#b#l\r\n";
							}
						}
						cm.sendOk(avail);
						break;
					case 2:
						
						物品栏=1;
						状态=2;
						var avail="#e#d可兑换物品如下:\r\n";
						for(var i=0;i<装备兑换.length;i++){
							avail+="\t\t#b#L"+i+"##v"+装备兑换[i][0]+"##r "+装备兑换[i][1]+"#b 积分兑换 #r"+装备兑换数量[i]+" #b个#b#l\r\n";
							//avail+="\t\t#b#L"+i+"##v"+装备兑换[i][0]+"##z"+装备兑换[i][0]+"##r "+装备兑换[i][1]+"#b 积分兑换 #r"+装备兑换数量[i]+" #b个#b#l\r\n";
						}
						cm.sendOk(avail);
						break;
					case 3:
					
						物品栏=2;
						状态=2;
						var avail="#e#d可兑换物品如下:\r\n";
						for(var i=0;i<卷轴兑换.length;i++){
							avail+="\t\t#b#L"+i+"##v"+卷轴兑换[i][0]+"##r "+卷轴兑换[i][1]+"#b 积分兑换 #r"+卷轴兑换数量[i]+" #b个#b#l\r\n";
							//avail+="\t\t#b#L"+i+"##v"+卷轴兑换[i][0]+"##z"+卷轴兑换[i][0]+"##r "+卷轴兑换[i][1]+"#b 积分兑换 #r"+卷轴兑换数量[i]+" #b个#b#l\r\n";
						}
						cm.sendOk(avail);
						break;
				}
				break;
			case 2:
				物品坐标=selection;
				if(物品坐标==10000){
					cm.sendYesNo("#b#e是否确认一键回收，回收后不可还原哦?");
				}else{
					switch(状态){
						case 1:	
							
							if(物品栏==1){
								if(!cm.haveItem(装备回收列表[物品坐标], 1)){
									cm.sendOk("您没有该道具，请确认。");
									cm.dispose();
									return;
								}
								cm.sendYesNo("#b#e是否回收#i"+装备回收列表[物品坐标]+"# X "+cm.itemQuantity(装备回收列表[物品坐标])+"?");
							}else{
								if(!cm.haveItem(卷轴回收列表[物品坐标], 1)){
									cm.sendOk("您没有该道具，请确认。");
									cm.dispose();
									return;
								}
								
								cm.sendYesNo("#b#e是否回收#i"+卷轴回收列表[物品坐标]+"# X "+cm.itemQuantity(卷轴回收列表[物品坐标])+"?");
							}
							break;
						case 2:
							if(物品栏==1)
								cm.sendYesNo("#b#e是否兑换#i"+装备兑换[物品坐标][0]+"#?");
							else
								cm.sendYesNo("#b#e是否兑换#i"+卷轴兑换[物品坐标][0]+"#?");
							break;
					}
				}
				break;
			case 3:
				var 总积分=0;
				if(物品坐标==10000){
					if(物品栏==1){
						for (var i = 0; i < 装备回收列表.length; i++) {
							if(cm.itemQuantity(装备回收列表[i])>0){
								总积分+=cm.itemQuantity(装备回收列表[i])
								cm.getPlayer().setjf3(cm.getPlayer().getjf3()+cm.itemQuantity(装备回收列表[i]));
								cm.gainItem(装备回收列表[i],-cm.itemQuantity(装备回收列表[i]));
							}
						}
						cm.sendOk("回收成功，共回收"+总积分+"点回收积分！");
						cm.dispose();
						return;
					}else{
						for (var i = 0; i < 卷轴回收列表.length; i++) {
							if(cm.itemQuantity(卷轴回收列表[i])>0){
								总积分+=cm.itemQuantity(卷轴回收列表[i])
								cm.getPlayer().setjf3(cm.getPlayer().getjf3()+cm.itemQuantity(卷轴回收列表[i]));
								cm.gainItem(卷轴回收列表[i],-cm.itemQuantity(卷轴回收列表[i]));
							}
						}
						cm.sendOk("回收成功，共回收"+总积分+"点回收积分！");
						cm.dispose();
						return;
					}
				}else{
					switch(状态){
						case 1:
							if(物品栏==1){
								总积分+=cm.itemQuantity(装备回收列表[物品坐标])
								cm.getPlayer().setjf3(cm.getPlayer().getjf3()+cm.itemQuantity(装备回收列表[物品坐标]));
								cm.gainItem(装备回收列表[物品坐标],-cm.itemQuantity(装备回收列表[物品坐标]));
							}else{
								总积分+=cm.itemQuantity(卷轴回收列表[物品坐标])
								cm.getPlayer().setjf3(cm.getPlayer().getjf3()+cm.itemQuantity(卷轴回收列表[物品坐标]));
								cm.gainItem(卷轴回收列表[物品坐标],-cm.itemQuantity(卷轴回收列表[物品坐标]));
							}
							cm.sendOk("回收成功，共回收"+总积分+"点回收积分！");
							cm.dispose();
							return;
							break;
						case 2:
						
							if(物品栏==1){
								if(cm.getInventory(1).isFull(1)) {
									cm.sendOk("请保证背包装备栏位至少有 #r2 #k个空格。");
									cm.dispose();
									return;
								}
								if(cm.getPlayer().getjf3()<装备兑换[物品坐标][1]){
									cm.sendOk("您的积分不够，请确认。");
									cm.dispose();
									return;
								}
								cm.getPlayer().setjf3(cm.getPlayer().getjf3()-装备兑换[物品坐标][1]);
								cm.gainItem(装备兑换[物品坐标][0],装备兑换数量[物品坐标]);
								cm.sendOk("兑换成功，请查看背包！");
							}else{
								if(cm.getInventory(2).isFull(1)) {
									cm.sendOk("请保证背包消耗栏位至少有 #r2 #k个空格。");
									cm.dispose();
									return;
								}
								if(cm.getInventory(4).isFull(1)) {
									cm.sendOk("请保证背包其他栏位至少有 #r2 #k个空格。");
									cm.dispose();
									return;
								}
								if(cm.getPlayer().getjf3()<卷轴兑换[物品坐标][1]){
									cm.sendOk("您的积分不够，请确认。");
									cm.dispose();
									return;
								}
								cm.getPlayer().setjf3(cm.getPlayer().getjf3()-卷轴兑换[物品坐标][1]);
								cm.gainItem(卷轴兑换[物品坐标][0],卷轴兑换数量[物品坐标]);
								cm.sendOk("兑换成功，请查看背包！");
							}
							cm.dispose();
							return;
							break;
					}
				}
				break;
		}
	}
}